class String
  TRANSLIT = {
    " " => ".", "'" => "", "`" => "",
    "А" => "A", "а" => "a", "Б" => "B", "б" => "b", "В" => "V", "в" => "v",
    "Г" => "H", "г" => "h", "Ґ" => "G", "ґ" => "g", "Д" => "D", "д" => "d",
    "Е" => "E", "е" => "e", "Є" => "YE", "є" => "ie", "Ж" => "ZH", "ж" => "zh",
    "З" => "Z", "з" => "z", "И" => "Y", "и" => "y", "I" => "I", "і" => "i",
    "Ї" => "YI", "ї" => "yi", "Й" => "Y", "й" => "i", "К" => "K", "к" => "k",
    "Л" => "L", "л" => "l", "М" => "M", "м" => "m", "Н" => "N", "н" => "n",
    "О" => "O", "о" => "o", "П" => "P", "п" => "p", "Р" => "R", "р" => "r",
    "C" => "S", "с" => "s", "Т" => "T", "т" => "t", "У" => "U", "у" => "u",
  }

  def emailize
      gsub(/\s+/, ".").
      gsub("`", "").
      gsub('ЗГ', 'ZGH').
      gsub('зг', 'zgh').
      gsub('Зг', 'Zgh').
      gsub('зГ', 'zGH').
      to_slug.transliterate(:ukrainian).to_s.downcase
  end
end

# frozen_string_literal: true